In [51]:
import pandas as pd
import numpy as np
import glob
import os

In [52]:
# Path to the directory containing your Parquet files
directory_path = 'C:/Users/comma/Github/workspace/sas-access-samples/SAS Foundation/parquetdataset/'

# Use glob to find all Parquet files in the directory
parquet_file_paths = glob.glob(directory_path + '*.parquet')

# Initialize an empty dictoionary to store the DataFrames
dfs = {}

In [53]:
# Function to decode bytes to string if the value is a byte literal
def decode_bytes(val):
    if isinstance(val, bytes):
        return val.decode('utf-8')
    return val

In [54]:
# Loop through the file paths
for path in parquet_file_paths:
    # Extract the base file name without the extension as the dictionary key
    file_name = path.split('/')[-1].replace('.parquet', '')
    
    # Read each file into a DataFrame
    df = pd.read_parquet(path)
    
    # Apply the decode_bytes function to each column using Series.map
    for col in df.columns:
        df[col] = df[col].map(decode_bytes)
    
    # Store the DataFrame in the dictionary with the file name as the key
    dfs[file_name] = df

In [55]:
df1 = dfs['parquetdataset\\samdat1']
df2 = dfs['parquetdataset\\samdat2']
df3 = dfs['parquetdataset\\samdat3']
df4 = dfs['parquetdataset\\samdat4']
df5 = dfs['parquetdataset\\samdat5']
df6 = dfs['parquetdataset\\samdat6']
df7 = dfs['parquetdataset\\samdat7']
df8 = dfs['parquetdataset\\samdat8']
df9 = dfs['parquetdataset\\samdat9']
df10 = dfs['parquetdataset\\samdat10']
df11 = dfs['parquetdataset\\samdat11']
df12 = dfs['parquetdataset\\samdat12']
df13 = dfs['parquetdataset\\samdat13']

In [56]:
df1.info()
df2.info()
df3.info()
df4.info()
df5.info()
df6.info()
df7.info()
df8.info()
df9.info()
df10.info()
df11.info()
df12.info()
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   DEPART    46 non-null     float64
 3   ORIG      46 non-null     object
 4   DEST      46 non-null     object
 5   MILES     46 non-null     float64
 6   BOARDED   46 non-null     float64
 7   CAPACITY  46 non-null     float64
dtypes: datetime64[ns](1), float64(4), object(3)
memory usage: 3.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   FLIGHT   26 non-null     object
 1   DATES    26 non-null     datetime64[ns]
 2   DEST     26 non-null     object
 3   BOARDED  26 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 964.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   FLIGHT  156 non-null    object
 1   DATES   156 non-null    datetime64[ns]
 2   DEST    156 non-null    object
 3   IDNUM   156 non-null    object
dtypes: datetime64[ns](1), object(3)
memory usage: 5.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    148 non-null    object
 1   SEX      148 non-null    object
 2   JOBCODE  148 non-null    object
 3   SALARY   148 non-null    float64
 4   BIRTH    148 non-null    datetime64[ns]
 5   HIRED    148 non-null    datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   IDNUM    12 non-null     object
 1   SEX      12 non-null     object
 2   JOBCODE  12 non-null     object
 3   SALARY   12 non-null     float64
 4   BIRTH    12 non-null     datetime64[ns]
 5   HIRED    12 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 708.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   IDNUM   148 non-null    object
 1   LNAME   148 non-null    object
 2   FNAME   148 non-null    object
 3   CITY    148 non-null    object
 4   STATE   148 non-null    object
 5   HPHONE  148 non-null    object
dtypes: object(6)
memory usage: 7.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   SUPID   19 non-null     object
 1   STATE   19 non-null     object
 2   JOBCAT  19 non-null     object
dtypes: object(3)
memory usage: 588.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   INVNUM    17 non-null     float64
 1   BILLEDTO  17 non-null     object
 2   AMTBILL   17 non-null     float64
 3   COUNTRY   17 non-null     object
 4   AMTINUS   17 non-null     float64
 5   BILLEDBY  17 non-null     float64
 6   BILLEDON  17 non-null     datetime64[ns]
 7   PAIDON    10 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(4), object(2)
memory usage: 1.2+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22 entries, 0 to 21
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPID     22 non-null     float64
 1   HIREDATE  22 non-null     datetime64[ns]
 2   SALARY    21 non-null     float64
 3   DEPT      22 non-null     object
 4   JOBCODE   22 non-null     float64
 5   GENDER    21 non-null     object
 6   BIRTHDTE  21 non-null     datetime64[ns]
 7   LASTNAME  22 non-null     object
 8   FRSTNAME  22 non-null     object
 9   MIDNAME   22 non-null     object
 10  PHONE     21 non-null     object
dtypes: datetime64[ns](2), float64(3), object(6)
memory usage: 2.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21 entries, 0 to 20
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   CUSTOMER  21 non-null     object
 1   STATE     11 non-null     object
 2   ZIPCODE   15 non-null     object
 3   COUNTRY   20 non-null     object
 4   PHONE     21 non-null     object
 5   NAME      20 non-null     object
 6   CONTACT   19 non-null     object
 7   ADDRESS   20 non-null     object
 8   CITY      20 non-null     object
 9   FIRSTORD  21 non-null     datetime64[ns]
dtypes: datetime64[ns](1), object(9)
memory usage: 1.8+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 0 to 37
Data columns (total 10 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ORDERNUM  38 non-null     float64
 1   STOCKNUM  38 non-null     float64
 2   LENGTH    38 non-null     float64
 3   FABCHARG  24 non-null     float64
 4   SHIPTO    38 non-null     object
 5   DATEORD   38 non-null     datetime64[ns]
 6   SHIPPED   15 non-null     datetime64[ns]
 7   TAKENBY   38 non-null     float64
 8   PROCSBY   15 non-null     float64
 9   SPECFLAG  10 non-null     object
dtypes: datetime64[ns](2), float64(6), object(2)
memory usage: 3.1+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPID     6 non-null      float64
 1   HIREDATE  6 non-null      datetime64[ns]
 2   DEPT      6 non-null      object
 3   GENDER    5 non-null      object
 4   LASTNAME  6 non-null      object
 5   FIRSTNAM  6 non-null      object
 6   MIDDLENA  5 non-null      object
 7   FAMILYID  2 non-null      float64
dtypes: datetime64[ns](1), float64(2), object(5)
memory usage: 516.0+ bytes

 /*=========================*/
 /* LIBNAME Sample 1       */
 /*=========================*/

proc print data=samples.SAMDAT7
   (keep=lname fname state hphone);
   where state = 'NJ';
   title 'Libname Sample 1: New Jersey Phone List';
run;

Brief Summary of SAS Program
The SAS program is designed to display a subset of data from a dataset SAMDAT7 which is part of the samples library. It filters the data to only include records where the state is 'New Jersey' (NJ). The columns included in the output are lname, fname, state, and hphone. The output is titled "Libname Sample 1: New Jersey Phone List".

In [57]:
# Sample 1: New Jersey Phone List

# Assuming the DataFrame for SAMDAT7 has been read and is named df7
import pandas as pd

# Filter rows where the state is 'NJ' and select specific columns
df1_nj = df7[df7['STATE'] == 'NJ'][['LNAME', 'FNAME', 'STATE', 'HPHONE']]

# Display the DataFrame
print(df1_nj)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df1_nj.shape[0]}')
print(f'Number of columns: {df1_nj.shape[1]}')

         LNAME    FNAME STATE        HPHONE
17      RHODES   JEREMY    NJ  201/812-1837
62     ALVAREZ   CARLOS    NJ  201/732-8787
66       DACKO    JASON    NJ  201/732-2323
69   HENDERSON  WILLIAM    NJ  201/812-4789
72     JOHNSON  JACKSON    NJ  201/732-3678
73     MURPHEY     JOHN    NJ  201/812-4414
74      PETERS  RANDALL    NJ  201/812-2478
77     NEWKIRK  WILLIAM    NJ  201/732-6611
79       ROUSE   JEREMY    NJ  201/732-9834
81    FUJIHARA    KYOKO    NJ  201/812-0902
85        VICK  THERESA    NJ  201/812-2424
92      YANCEY    ROBIN    NJ  201/812-1874
100   LAWRENCE    KATHY    NJ  201/812-3337
101    NEWKIRK   SANDRA    NJ  201/812-3331
109   BAREFOOT   JOSEPH    NJ  201/812-5665
Number of rows: 15
Number of columns: 4

/*=========================*/
 /* LIBNAME Sample 2       */
 /*=========================*/

data work.highwage;
  set samples.SAMDAT5(drop=sex birth hired);
  if salary>60000 then
    CATEGORY='High';
  else if salary<30000 then
    CATEGORY='Low';
  else
    CATEGORY='Avg';
run;

proc print data=work.highwage;
  title 'Libname Sample 2: Salary Analysis';
  format SALARY dollar10.2;
run;

SAS Code Summary
This SAS program processes data from a dataset named SAMDAT5 within a library called samples. It drops the columns sex, birth, and hired, and creates a new variable CATEGORY based on the value of salary. The categories are defined as 'High' for salaries over 60,000, 'Low' for salaries under 30,000, and 'Avg' for anything in between. Finally, it prints the resulting dataset with the salary formatted as a dollar amount.

In [58]:
# Sample 2: Salary Analysis

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5
df2_highwage = df5.drop(columns=['SEX', 'BIRTH', 'HIRED'])

# Categorize salary into 'High', 'Low', 'Avg'
def categorize_salary(salary):
    if salary > 60000:
        return 'High'
    elif salary < 30000:
        return 'Low'
    else:
        return 'Avg'

df2_highwage['CATEGORY'] = df2_highwage['SALARY'].apply(categorize_salary)

# Formatting the salary as dollar value
df2_highwage['SALARY'] = df2_highwage['SALARY'].apply(lambda x: f'${x:,.2f}')

# Display the DataFrame
print(df2_highwage)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df2_highwage.shape[0]}')
print(f'Number of columns: {df2_highwage.shape[1]}')

    IDNUM JOBCODE      SALARY CATEGORY
0    1009     TA1  $28,880.00      Low
1    1017     TA3  $40,858.00      Avg
2    1036     TA3  $39,392.00      Avg
3    1037     TA1  $28,558.00      Low
4    1038     TA1  $26,533.00      Low
..    ...     ...         ...      ...
143  1970     FA1  $22,615.00      Low
144  1983     FA3  $33,419.00      Avg
145  1988     FA3  $32,217.00      Avg
146  1991     TA1  $27,645.00      Low
147  1995     ME1  $28,810.00      Low

[148 rows x 4 columns]
Number of rows: 148
Number of columns: 4

/*=========================*/
 /* LIBNAME Sample 3       */
 /*=========================*/

 data work.combined;
  merge samples.SAMDAT7 samples.SAMDAT8(in=super
    rename=(SUPID=IDNUM));
  by IDNUM;
  if super;
run;

proc print data=work.combined;
  title 'Libname Sample 3: Supervisor Information';
run;

SAS Code Summary
The SAS program merges two datasets, SAMDAT7 and SAMDAT8 from the samples library. During the merge, it renames SUPID to IDNUM in SAMDAT8, uses IDNUM as the key for the merge, and includes only those records in the merged dataset that are present in SAMDAT8 (as indicated by the in=super condition).

In [59]:
print(df7)
print(df8)

    IDNUM      LNAME      FNAME        CITY STATE        HPHONE
0    1009     MORGAN     GEORGE    NEW YORK    NY  212/586-7753
1    1017      WELCH     DARIUS    NEW YORK    NY  212/586-5535
2    1036       WONG     LESLIE    NEW YORK    NY  212/587-2570
3    1037       CHOW       JANE    STAMFORD    CT  203/781-8868
4    1038  RODRIGUEZ      MARIA  BRIDGEPORT    CT  203/675-2048
..    ...        ...        ...         ...   ...           ...
143  1970     PARKER       ANNE    NEW YORK    NY  718/383-3895
144  1983       DEAN     SHARON    NEW YORK    NY  718/384-1647
145  1988     COOPER    ANTHONY    NEW YORK    NY  212/587-1228
146  1991     HOWARD   GRETCHEN  BRIDGEPORT    CT  203/675-0007
147  1995     VARNER  ELIZABETH    NEW YORK    NY  718/384-7113

[148 rows x 6 columns]
   SUPID STATE JOBCAT
0   1106    CT     PT
1   1118    NY     PT
2   1126    NY     TA
3   1352    NY     NA
4   1385    CT     ME
5   1401    NJ     TA
6   1405    NJ     SC
7   1417    NJ     NA
8   1420    NJ     ME
9   1431    CT     FA
10  1433    NJ     FA
11  1442    NJ     PT
12  1564    NY     SC
13  1639    CT     TA
14  1677    CT     BC
15  1834    NY     BC
16  1882    NY     ME
17  1935    CT     NA
18  1983    NY     FA

In [60]:
# Sample 3: Supervisor Information

import pandas as pd

# Assuming DataFrames df7 and df8 correspond to SAMDAT7 and SAMDAT8
# Renaming SUPID to IDNUM in df8 before merging
df8_renamed = df8.rename(columns={'SUPID': 'IDNUM'})

# Merging df7 and df8 on IDNUM
# Using an indicator to replicate the 'in=super' SAS functionality
df3_combined = pd.merge(df7, df8_renamed, on='IDNUM', how='inner', indicator=True)

# Filter rows to include only those that come from df8 (as per 'if super;' in SAS)
df3_combined = df3_combined[df3_combined['_merge'] == 'both']

# Drop the merge indicator column used for filtering
df3_combined.drop(columns=['_merge'], inplace=True)

# Display the DataFrame
print(df3_combined)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df3_combined.shape[0]}')
print(f'Number of columns: {df3_combined.shape[1]}')

   IDNUM         LNAME    FNAME        CITY STATE_x        HPHONE STATE_y  \
0   1106     MARSHBURN   JASPER    STAMFORD      CT  203/781-1457      CT
1   1118        DENNIS    ROGER    NEW YORK      NY  718/383-1122      NY
2   1126        KIMANI     ANNE    NEW YORK      NY  212/586-1229      NY
3   1352        RIVERS    SIMON    NEW YORK      NY  718/383-3345      NY
4   1385        RAYNOR   MILTON  BRIDGEPORT      CT  203/675-2846      CT
5   1401       ALVAREZ   CARLOS    PATERSON      NJ  201/732-8787      NJ
6   1405         DACKO    JASON    PATERSON      NJ  201/732-2323      NJ
7   1417       NEWKIRK  WILLIAM    PATERSON      NJ  201/732-6611      NJ
8   1420         ROUSE   JEREMY    PATERSON      NJ  201/732-9834      NJ
9   1431         YOUNG  DEBORAH    STAMFORD      CT  203/781-2987      CT
10  1433        YANCEY    ROBIN   PRINCETON      NJ  201/812-1874      NJ
11  1442       NEWKIRK   SANDRA   PRINCETON      NJ  201/812-3331      NJ
12  1564       WALTERS     ANNE    NEW YORK      NY  212/587-3257      NY
13  1639  CARTER-COHEN    KAREN    STAMFORD      CT  203/781-8839      CT
14  1677        KRAMER  JACKSON  BRIDGEPORT      CT  203/675-7432      CT
15  1834       LEBLANC  RUSSELL    NEW YORK      NY  718/384-0040      NY
16  1882        TUCKER     ALAN    NEW YORK      NY  718/384-0216      NY
17  1935     FERNANDEZ  KATRINA  BRIDGEPORT      CT  203/675-2962      CT
18  1983          DEAN   SHARON    NEW YORK      NY  718/384-1647      NY

   JOBCAT
0      PT
1      PT
2      TA
3      NA
4      ME
5      TA
6      SC
7      NA
8      ME
9      FA
10     FA
11     PT
12     SC
13     TA
14     BC
15     BC
16     ME
17     NA
18     FA
Number of rows: 19
Number of columns: 8

 /*=========================*/
 /* LIBNAME Sample 4       */
 /*=========================*/

data work.payroll;
  update samples.SAMDAT5
         samples.SAMDAT6;
  by IDNUM;
run;

proc print data=work.payroll;
  title 'Libname Sample 4: Updated Payroll Data';
run;

SAS Code Summary
This SAS program uses the update statement to combine two datasets, SAMDAT5 and SAMDAT6 from the samples library, based on the IDNUM column. The update operation in SAS replaces or updates rows in the master dataset (SAMDAT5) with rows from the transaction dataset (SAMDAT6) when the IDNUM values match. If IDNUM is not present in SAMDAT5, the row from SAMDAT6 is not addedâ€”this differs from a full merge.

In [61]:
# Sample 4: Updated Payroll Data

import pandas as pd

# Assuming DataFrames df5 and df6 correspond to SAMDAT5 and SAMDAT6
# Setting IDNUM as the index for proper updating
df5.set_index('IDNUM', inplace=True)
df6.set_index('IDNUM', inplace=True)

# Update df5 with df6
df4_payroll = df5.combine_first(df6)

# Reset index to move IDNUM back to a column
df4_payroll.reset_index(inplace=True)

# Display the DataFrame
print(df4_payroll)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df4_payroll.shape[0]}')
print(f'Number of columns: {df4_payroll.shape[1]}')

    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
4    1038   F     TA1  26533.0 1969-11-09 1991-11-23
..    ...  ..     ...      ...        ...        ...
145  1983   F     FA3  33419.0 1962-02-28 1987-04-27
146  1988   M     FA3  32217.0 1959-11-30 1984-09-18
147  1991   F     TA1  27645.0 1972-05-07 1992-12-12
148  1995   F     ME1  28810.0 1973-08-24 1993-09-19
149  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[150 rows x 6 columns]
Number of rows: 150
Number of columns: 6

 /*=========================*/
 /* LIBNAME Sample 5       */
 /*=========================*/
title 'Libname Sample 5: Total Salary by Jobcode';

proc sql;
  select JOBCODE label='Jobcode',
         sum(SALARY) as total
         label='Total for Group'
         format=dollar11.2
  from samples.SAMDAT5
  group by JOBCODE;
quit;

SAS Code Summary
This SAS program calculates the total salary by job code from the dataset SAMDAT5. It groups by JOBCODE, and the total salary for each job code is formatted as a dollar amount.

In [62]:
# Sample 5: Total Salary by Jobcode

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5
# Calculating the sum of SALARY grouped by JOBCODE
df5_salary_group = df5.groupby('JOBCODE')['SALARY'].sum().reset_index()

# Renaming the columns to match SAS output
df5_salary_group.columns = ['Jobcode', 'Total for Group']

# Formatting the total salary as dollar value
df5_salary_group['Total for Group'] = df5_salary_group['Total for Group'].apply(lambda x: f'${x:,.2f}')

# Display the DataFrame
print(df5_salary_group)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df5_salary_group.shape[0]}')
print(f'Number of columns: {df5_salary_group.shape[1]}')

   Jobcode Total for Group
0      BCK     $232,148.00
1      FA1     $253,433.00
2      FA2     $447,790.00
3      FA3     $230,537.00
4      ME1     $228,002.00
5      ME2     $498,076.00
6      ME3     $296,875.00
7      NA1     $210,161.00
8      NA2     $157,149.00
9      PT1     $543,264.00
10     PT2     $879,252.00
11     PT3     $221,009.00
12     SCP     $128,162.00
13     TA1     $249,492.00
14     TA2     $671,499.00
15     TA3     $476,155.00
Number of rows: 16
Number of columns: 2

 /*=========================*/
 /* LIBNAME Sample 6       */
 /*=========================*/

title 'Libname Sample 6: Flights to London and Frankfurt';

proc sql;
  select DATES, DEST from samples.SAMDAT2
  where (DEST eq "FRA") or
    (DEST eq "LON")
  order by DEST;
quit;

SAS Code Summary
This SAS program selects records from the SAMDAT2 dataset, filtering to include only flights headed to London ("LON") or Frankfurt ("FRA"). The results are ordered by the destination (DEST).

In [63]:
# Sample 6: Flights to London and Frankfurt

import pandas as pd

# Assuming DataFrame df2 corresponds to SAMDAT2
# Filtering for flights to Frankfurt (FRA) and London (LON)
df6_flights = df2[df2['DEST'].isin(['FRA', 'LON'])]

# Sorting by destination
df6_flights = df6_flights.sort_values(by='DEST')

# Display the DataFrame
print(df6_flights[['DATES', 'DEST']])

# Show the number of columns and rows for the data output
print(f'Number of rows: {df6_flights.shape[0]}')
print(f'Number of columns: {df6_flights.shape[1]}')

        DATES DEST
3  1998-03-01  FRA
10 1998-03-02  FRA
17 1998-03-03  FRA
24 1998-03-04  FRA
31 1998-03-05  FRA
42 1998-03-07  FRA
2  1998-03-01  LON
9  1998-03-02  LON
16 1998-03-03  LON
23 1998-03-04  LON
30 1998-03-05  LON
36 1998-03-06  LON
41 1998-03-07  LON
Number of rows: 13
Number of columns: 7

 /*=========================*/
 /* LIBNAME Sample 7       */
 /*=========================*/

proc sql;
   title  'Libname Sample 7: International Flights by Flight Number';
   title2 'with Over 200 Passengers';
   select FLIGHT   label="Flight Number",
          DATES    label="Departure Date",
          DEST     label="Destination",
          BOARDED  label="Number Boarded"
     from samples.SAMDAT3
    where BOARDED > 200
    order by FLIGHT;
quit;

SAS Code Summary
This program selects flight information from the SAMDAT3 dataset for flights that boarded more than 200 passengers. It retrieves flight number, departure date, destination, and number boarded, ordering the results by flight number.

In [64]:
# Sample 7: International Flights by Flight Number with Over 200 Passengers

import pandas as pd

# Assuming DataFrame df3 corresponds to SAMDAT3
# Filtering for flights with more than 200 passengers boarded
df7_flights = df3[df3['BOARDED'] > 200]

# Sorting by flight number
df7_flights = df7_flights.sort_values(by='FLIGHT')

# Display the DataFrame with specified columns and custom labels
print(df7_flights[['FLIGHT', 'DATES', 'DEST', 'BOARDED']].rename(columns={
    'FLIGHT': 'Flight Number',
    'DATES': 'Departure Date',
    'DEST': 'Destination',
    'BOARDED': 'Number Boarded'
}))

# Show the number of columns and rows for the data output
print(f'Number of rows: {df7_flights.shape[0]}')
print(f'Number of columns: {df7_flights.shape[1]}')

   Flight Number Departure Date Destination  Number Boarded
12           219     1998-03-04         LON           232.0
22           219     1998-03-07         LON           241.0
1            622     1998-03-01         FRA           207.0
23           622     1998-03-07         FRA           210.0
Number of rows: 4
Number of columns: 4

 /*=========================*/
 /* LIBNAME Sample 8        */
 /*=========================*/

title 'Libname Sample 8: Employees with salary greater than $40,000';

proc sql;
  select a.LNAME, a.FNAME, b.SALARY
    format=dollar10.2
  from samples.SAMDAT7 a, samples.SAMDAT5 b
  where (a.IDNUM eq b.IDNUM) and
    (b.SALARY gt 40000);
quit;

SAS Code Summary
This SAS program performs a join between two datasets, SAMDAT7 and SAMDAT5, matching by IDNUM. It then selects employees with salaries greater than $40,000, displaying their last name, first name, and salary formatted as a dollar amount.

In [65]:
# Sample 8: Employees with salary greater than $40,000

import pandas as pd

# Assuming DataFrames df7 and df5 correspond to SAMDAT7 and SAMDAT5
# Merging data on IDNUM
df8_employees = pd.merge(df7, df5, on='IDNUM')

# Filtering for salaries greater than 40,000
df8_employees = df8_employees[df8_employees['SALARY'] > 40000]

# Formatting the salary as dollar value
df8_employees['SALARY'] = df8_employees['SALARY'].apply(lambda x: f'${x:,.2f}')

# Display the DataFrame
print(df8_employees[['LNAME', 'FNAME', 'SALARY']])

# Show the number of columns and rows for the data output
print(f'Number of rows: {df8_employees.shape[0]}')
print(f'Number of columns: {df8_employees.shape[1]}')

            LNAME      FNAME       SALARY
1           WELCH     DARIUS   $40,858.00
7          VENTER    RANDALL   $66,558.00
15      MARSHBURN     JASPER   $89,632.00
16       THOMPSON      WAYNE   $89,977.00
17         RHODES     JEREMY   $40,586.00
24         DENNIS      ROGER  $111,379.00
32         KIMANI       ANNE   $40,899.00
45         CASTON   FRANKLIN   $41,690.00
47     STEPHENSON       ADAM   $42,178.00
48       BANADYGA     JUSTIN   $88,606.00
49         O'NEAL      BRYAN   $40,079.00
51         RIVERS      SIMON   $53,798.00
56         MORGAN     ALFRED   $42,264.00
58         RAYNOR     MILTON   $43,900.00
65          COHEN        LEE   $91,376.00
68      GREGORSKI     DANIEL   $68,096.00
70        HAVELKA    RAYMOND   $41,551.00
71         HARRIS    CHARLES   $84,685.00
77        NEWKIRK    WILLIAM   $52,270.00
79          ROUSE     JEREMY   $43,071.00
87          BRADY  CHRISTINE   $68,767.00
98     HASENHAUER  CHRISTINA   $70,736.00
101       NEWKIRK     SANDRA   $84,536.00
102         WELLS      AGNES   $42,274.00
106        NEWTON      JAMES   $84,203.00
109      BAREFOOT     JOSEPH   $43,025.00
110        PARKER        JAY   $41,526.00
111       HERRERO      CLYDE   $66,130.00
113    PENNINGTON    MICHAEL   $71,349.00
118  CARTER-COHEN      KAREN   $40,260.00
125    BRANCACCIO     JOSEPH   $66,517.00
126        LUFKIN        ROY  $109,630.00
129         TRIPP      KATHY   $84,471.00
131        NORRIS      DIANE   $43,433.00
134        TUCKER       ALAN   $41,538.00
135    STEPHENSON     ROBERT   $91,908.00
137        GRAHAM      ALVIN   $65,111.00
141      UPCHURCH      LARRY   $89,858.00
142     FERNANDEZ    KATRINA   $51,081.00
Number of rows: 39
Number of columns: 11

 /*==========================*/
 /* LIBNAME Sample 9         */
 /*==========================*/

/* SQL Implicit Passthru ON */
title 'Libname Sample 9a: Delayed International Flights in March';

proc sql;
  select distinct samdat1.FLIGHT,
      samdat1.DATES,
      DELAY format=2.0
    from samples.SAMDAT1, samples.SAMDAT2, samples.SAMDAT3
  where samdat1.FLIGHT=samdat2.FLIGHT and
        samdat1.DATES=samdat2.DATES and
        samdat1.FLIGHT=samdat3.FLIGHT and
        DELAY>0
  order by DELAY descending;
quit;

SAS Code Summary
This SAS program performs a multi-table join on three datasets (SAMDAT1, SAMDAT2, SAMDAT3) based on flight number and dates. It selects flights with a delay greater than zero and orders the results by the delay in descending order. The query focuses on distinct records, indicating a need to avoid duplicate entries in the output.

In [66]:
df1.info()
df2.info()
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   DEPART    46 non-null     float64
 3   ORIG      46 non-null     object
 4   DEST      46 non-null     object
 5   MILES     46 non-null     float64
 6   BOARDED   46 non-null     float64
 7   CAPACITY  46 non-null     float64
dtypes: datetime64[ns](1), float64(4), object(3)
memory usage: 3.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   FLIGHT   26 non-null     object
 1   DATES    26 non-null     datetime64[ns]
 2   DEST     26 non-null     object
 3   BOARDED  26 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 964.0+ bytes

In [67]:
# Sample 9a: Delayed International Flights in March

import pandas as pd

# Assuming DataFrames df1, df2, and df3 correspond to SAMDAT1, SAMDAT2, and SAMDAT3
# Performing the joins
df9_flights = pd.merge(df1, df2, on=['FLIGHT', 'DATES'])
df9_flights = pd.merge(df9_flights, df3, on=['FLIGHT'])

# Filtering for delays greater than 0
df9_flights = df9_flights[df9_flights['DELAY'] > 0]

# Removing duplicates
df9_flights = df9_flights.drop_duplicates(subset=['FLIGHT', 'DATES', 'DELAY'])

# Sorting by delay in descending order
df9_flights = df9_flights.sort_values(by='DELAY', ascending=False)

# Formatting the delay to show only two decimal places
df9_flights['DELAY'] = df9_flights['DELAY'].map('{:.2f}'.format)

# Display the DataFrame
print(df9_flights[['FLIGHT', 'DATES', 'DELAY']])

# Show the number of columns and rows for the data output
print(f'Number of rows: {df9_flights.shape[0]}')
print(f'Number of columns: {df9_flights.shape[1]}')

KeyError: Index(['DATES'], dtype='object')

In [ ]:
# Sample 9a: Delayed International Flights in March

import pandas as pd

# Assuming DataFrames df1, df2, and df3 correspond to SAMDAT1, SAMDAT2, and SAMDAT3
# Ensure all DataFrame column names are in uppercase to avoid case sensitivity issues
df1.columns = [x.upper() for x in df1.columns]
df2.columns = [x.upper() for x in df2.columns]
df3.columns = [x.upper() for x in df3.columns]

# Check if 'FLIGHT' and 'DATES' columns are available in df1 and df2
if not all(col in df1.columns and col in df2.columns for col in ['FLIGHT', 'DATES']):
    print("Error: Necessary columns ['FLIGHT', 'DATES'] are missing in df1 or df2.")
else:
    df9_flights = pd.merge(df1, df2, on=['FLIGHT', 'DATES'], how='inner')

    # Check if 'FLIGHT' is present in df3 for the merge
    if 'FLIGHT' in df3.columns and 'DATES' in df3.columns:
        df9_flights = pd.merge(df9_flights, df3, on=['FLIGHT', 'DATES'], how='inner')
    elif 'FLIGHT' in df3.columns:
        df9_flights = pd.merge(df9_flights, df3, on='FLIGHT', how='inner')
    else:
        print("Error: 'FLIGHT' column is missing in df3.")

    # Check if 'DELAY' is in the DataFrame after merging
    if 'DELAY' in df9_flights.columns:
        # Filtering for delays greater than 0
        df9_flights = df9_flights[df9_flights['DELAY'] > 0]
        df9_flights = df9_flights.drop_duplicates(subset=['FLIGHT', 'DATES', 'DELAY'])

        # Sorting by delay in descending order
        df9_flights = df9_flights.sort_values(by='DELAY', ascending=False)

        # Formatting the delay to show only two decimal places
        df9_flights['DELAY'] = df9_flights['DELAY'].map('{:.2f}'.format)

        # Display the DataFrame
        print(df9_flights[['FLIGHT', 'DATES', 'DELAY']])
    else:
        print("Error: 'DELAY' column is missing after merging.")

    # Show the number of columns and rows for the data output
    print(f'Number of rows: {df9_flights.shape[0]}')
    print(f'Number of columns: {df9_flights.shape[1]}')

   FLIGHT      DATES  DELAY
23    622 1998-03-04  30.00
12    219 1998-03-06  27.00
25    622 1998-03-07  21.00
8     219 1998-03-02  18.00
7     219 1998-03-01  18.00
13    219 1998-03-07  15.00
0     132 1998-03-01  14.00
5     132 1998-03-06   7.00
2     132 1998-03-03   6.00
1     132 1998-03-02   5.00
14    271 1998-03-01   5.00
17    271 1998-03-04   5.00
18    271 1998-03-05   5.00
9     219 1998-03-03   4.00
15    271 1998-03-02   4.00
19    271 1998-03-07   4.00
10    219 1998-03-04   3.00
11    219 1998-03-05   3.00
4     132 1998-03-05   3.00
16    271 1998-03-03   2.00
Number of rows: 20
Number of columns: 15

 /*==========================*/
 /* LIBNAME Sample 9c        */
 /*==========================*/

title 'Libname Sample 9c: Delayed International Flights in March';

proc sql;
  select distinct samdat1.FLIGHT,
      samdat1.DATES,
      DELAY format=2.0
    from samples.SAMDAT1
    full join samples.SAMDAT2 on
      samdat1.FLIGHT = samdat2.FLIGHT
    full join samples.SAMDAT3 on
      samdat1.FLIGHT = samdat3.FLIGHT
  order by DELAY descending;
quit;

SAS Code Summary
This SAS program joins three datasets (SAMDAT1, SAMDAT2, SAMDAT3) using a full join based on flight number. It selects distinct records for international flights showing the flight number, date, and delay, ordering the results by the delay in descending order.

In [ ]:
# Sample 9c: Delayed International Flights in March

import pandas as pd

# Assuming DataFrames df1, df2, and df3 correspond to SAMDAT1, SAMDAT2, and SAMDAT3
# Performing the full joins
df9c_flights = pd.merge(df1, df2, on='FLIGHT', how='outer')
df9c_flights = pd.merge(df9c_flights, df3, on='FLIGHT', how='outer')

# Removing duplicates
df9c_flights = df9c_flights.drop_duplicates(subset=['FLIGHT', 'DATES', 'DELAY'])

# Sorting by delay in descending order
df9c_flights = df9c_flights.sort_values(by='DELAY', ascending=False)

# Formatting the delay to show only two decimal places
df9c_flights['DELAY'] = df9c_flights['DELAY'].map('{:.2f}'.format)

# Display the DataFrame
print(df9c_flights[['FLIGHT', 'DATES', 'DELAY']])

# Show the number of columns and rows for the data output
print(f'Number of rows: {df9c_flights.shape[0]}')
print(f'Number of columns: {df9c_flights.shape[1]}')

     FLIGHT      DATES  DELAY
1054    622 1998-03-01  30.00
1055    622 1998-03-02  30.00
1056    622 1998-03-03  30.00
1057    622 1998-03-04  30.00
1058    622 1998-03-05  30.00
...     ...        ...    ...
1061    622 1998-03-02  -6.00
1064    622 1998-03-05  -6.00
1065    622 1998-03-07  -6.00
1060    622 1998-03-01  -6.00
1063    622 1998-03-04  -6.00

[154 rows x 3 columns]
Number of rows: 154
Number of columns: 17

/*==========================*/
 /* LIBNAME Sample 10        */
 /*==========================*/

title 'Libname Sample 10: Payrolls 1 & 2';

proc sql;
  select IDNUM, SEX, JOBCODE, SALARY,
         BIRTH,
         HIRED
     from samples.SAMDAT5
  outer union corr
  select *
     from samples.SAMDAT6
   order by IDNUM, JOBCODE, SALARY;
quit;

SAS Code Summary:
This SAS program performs an outer union of two datasets, SAMDAT5 and SAMDAT6, effectively merging their records while keeping all columns aligned by name. It ensures that records unique to each dataset are included and then sorts the results by IDNUM, JOBCODE, and SALARY.

In [ ]:
# Libname Sample 10: Payrolls 1 & 2

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5 and DataFrame df6 to SAMDAT6
# Making copies of the dataframes with only the required columns for union operation
df10_df5_subset = df5[['IDNUM', 'SEX', 'JOBCODE', 'SALARY', 'BIRTH', 'HIRED']].copy()
df10_df6_subset = df6[['IDNUM', 'SEX', 'JOBCODE', 'SALARY', 'BIRTH', 'HIRED']].copy()

# Concatenating subsets and dropping duplicates to mimic 'outer union corr'
df10_payrolls = pd.concat([df10_df5_subset, df10_df6_subset]).drop_duplicates().reset_index(drop=True)

# Sorting the DataFrame
df10_payrolls = df10_payrolls.sort_values(by=['IDNUM', 'JOBCODE', 'SALARY'])

# Display the DataFrame
print(df10_payrolls)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df10_payrolls.shape[0]}')
print(f'Number of columns: {df10_payrolls.shape[1]}')

KeyError: "['IDNUM'] not in index"

In [ ]:
# Libname Sample 10: Payrolls 1 & 2

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5 and DataFrame df6 to SAMDAT6
# Ensure column names are uppercase to avoid case sensitivity issues
df5.columns = [x.upper() for x in df5.columns]
df6.columns = [x.upper() for x in df6.columns]

# Check if required columns are present in both dataframes
required_columns = ['IDNUM', 'SEX', 'JOBCODE', 'SALARY', 'BIRTH', 'HIRED']
missing_df5 = [col for col in required_columns if col not in df5.columns]
missing_df6 = [col for col in required_columns if col not in df6.columns]

if missing_df5 or missing_df6:
    print(f"Missing columns in df5: {missing_df5}")
    print(f"Missing columns in df6: {missing_df6}")
else:
    # Making copies of the dataframes with only the required columns for union operation
    df10_df5_subset = df5[required_columns].copy()
    df10_df6_subset = df6[required_columns].copy()

    # Concatenating subsets and dropping duplicates to mimic 'outer union corr'
    df10_payrolls = pd.concat([df10_df5_subset, df10_df6_subset]).drop_duplicates().reset_index(drop=True)

    # Sorting the DataFrame
    df10_payrolls = df10_payrolls.sort_values(by=['IDNUM', 'JOBCODE', 'SALARY'])

    # Display the DataFrame
    print(df10_payrolls)

    # Show the number of columns and rows for the data output
    print(f'Number of rows: {df10_payrolls.shape[0]}')
    print(f'Number of columns: {df10_payrolls.shape[1]}')

    IDNUM SEX JOBCODE   SALARY      BIRTH      HIRED
0    1009   M     TA1  28880.0 1959-03-02 1992-03-26
1    1017   M     TA3  40858.0 1957-12-28 1981-10-16
2    1036   F     TA3  39392.0 1965-05-19 1984-10-23
148  1036   F     TA3  42465.0 1965-05-19 1984-10-23
3    1037   F     TA1  28558.0 1964-04-10 1992-09-13
..    ...  ..     ...      ...        ...        ...
144  1983   F     FA3  33419.0 1962-02-28 1987-04-27
145  1988   M     FA3  32217.0 1959-11-30 1984-09-18
146  1991   F     TA1  27645.0 1972-05-07 1992-12-12
147  1995   F     ME1  28810.0 1973-08-24 1993-09-19
159  1998   M     SCP  23100.0 1970-09-10 1992-11-02

[160 rows x 6 columns]
Number of rows: 160
Number of columns: 6

 /*==========================*/
 /* LIBNAME Sample 11        */
 /*==========================*/

proc sql undo_policy=none;
insert into samples.SAMDAT8
	values('1588','NY','FA');
quit;

proc print data=samples.SAMDAT8;
	title 'Libname Sample 11: New Row in AIRLINE.SAMDAT8';
run;

SAS Code Summary
The SAS code performs an insert operation to add a new row to the dataset SAMDAT8. The new row contains specific values for given columns, presumably identified as ID, state, and job code or function. After the insertion, the dataset is printed with a title indicating the operation.

In [ ]:
# Libname Sample 11: New Row in AIRLINE.SAMDAT8

import pandas as pd

# Assuming DataFrame df8 corresponds to SAMDAT8
# Creating a new row and appending it to df8
new_row = pd.DataFrame({'COLUMN1': ['1588'], 'COLUMN2': ['NY'], 'COLUMN3': ['FA']})
df11_samdat8 = df8.append(new_row, ignore_index=True)

# Display the updated DataFrame
print(df11_samdat8)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df11_samdat8.shape[0]}')
print(f'Number of columns: {df11_samdat8.shape[1]}')

AttributeError: 'DataFrame' object has no attribute 'append'

 /*==========================*/
 /* LIBNAME Sample 13        */
 /*==========================*/

proc sql;

  create table work.gtforty as
  select LNAME as lastname,
         FNAME as firstname,
         SALARY as Salary
  from samples.SAMDAT7 a, samples.SAMDAT5 b
  where (a.IDNUM eq b.IDNUM) and (SALARY gt 40000);

quit;

proc print data=work.gtforty noobs;
  title 'Libname Sample 13: Employees with salaries over $40,000';
  format SALARY dollar10.2;

run;

SAS Code Summary
This SAS code joins two datasets, SAMDAT7 and SAMDAT5, on a common field (IDNUM) and selects employees with salaries greater than $40,000. It creates a new table work.gtforty containing last name, first name, and salary of these employees. The result is printed with salary values formatted as dollar amounts.

In [ ]:
# Libname Sample 13: Employees with salaries over $40,000

import pandas as pd

# Assuming df7 corresponds to SAMDAT7 and df5 to SAMDAT5
# Merging dataframes on IDNUM
df13_merged = pd.merge(df7[['IDNUM', 'LNAME', 'FNAME']], df5[['IDNUM', 'SALARY']], on='IDNUM')

# Filtering for salaries greater than $40,000
df13_gtforty = df13_merged[df13_merged['SALARY'] > 40000]

# Renaming columns as specified in the SAS code
df13_gtforty = df13_gtforty.rename(columns={'LNAME': 'LASTNAME', 'FNAME': 'FIRSTNAME', 'SALARY': 'Salary'})

# Formatting the salary as dollar values
df13_gtforty['Salary'] = df13_gtforty['Salary'].apply(lambda x: f'${x:,.2f}')

# Display the DataFrame
print(df13_gtforty)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df13_gtforty.shape[0]}')
print(f'Number of columns: {df13_gtforty.shape[1]}')

KeyError: "['IDNUM'] not in index"

In [ ]:
# Libname Sample 11: New Row in AIRLINE.SAMDAT8

import pandas as pd

# Assuming DataFrame df8 corresponds to SAMDAT8
# Creating a new row and appending it to df8 using pd.concat()
new_row = pd.DataFrame({'COLUMN1': ['1588'], 'COLUMN2': ['NY'], 'COLUMN3': ['FA']})
df11_samdat8 = pd.concat([df8, new_row], ignore_index=True)

# Display the updated DataFrame
print(df11_samdat8)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df11_samdat8.shape[0]}')
print(f'Number of columns: {df11_samdat8.shape[1]}')

   SUPID STATE JOBCAT COLUMN1 COLUMN2 COLUMN3
0   1106    CT     PT     NaN     NaN     NaN
1   1118    NY     PT     NaN     NaN     NaN
2   1126    NY     TA     NaN     NaN     NaN
3   1352    NY     NA     NaN     NaN     NaN
4   1385    CT     ME     NaN     NaN     NaN
5   1401    NJ     TA     NaN     NaN     NaN
6   1405    NJ     SC     NaN     NaN     NaN
7   1417    NJ     NA     NaN     NaN     NaN
8   1420    NJ     ME     NaN     NaN     NaN
9   1431    CT     FA     NaN     NaN     NaN
10  1433    NJ     FA     NaN     NaN     NaN
11  1442    NJ     PT     NaN     NaN     NaN
12  1564    NY     SC     NaN     NaN     NaN
13  1639    CT     TA     NaN     NaN     NaN
14  1677    CT     BC     NaN     NaN     NaN
15  1834    NY     BC     NaN     NaN     NaN
16  1882    NY     ME     NaN     NaN     NaN
17  1935    CT     NA     NaN     NaN     NaN
18  1983    NY     FA     NaN     NaN     NaN
19   NaN   NaN    NaN    1588      NY      FA
Number of rows: 20
Number of columns: 6

In [ ]:
# Libname Sample 11: New Row in AIRLINE.SAMDAT8

import pandas as pd

# Assuming DataFrame df8 corresponds to SAMDAT8
# Creating a new row and appending it to df8 using pd.concat()
new_row = pd.DataFrame({'SUPID': ['1588'], 'STATE': ['NY'], 'JOBCAT': ['FA']})
df11_samdat8 = pd.concat([df8, new_row], ignore_index=True)

# Display the updated DataFrame
print(df11_samdat8)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df11_samdat8.shape[0]}')
print(f'Number of columns: {df11_samdat8.shape[1]}')

   SUPID STATE JOBCAT
0   1106    CT     PT
1   1118    NY     PT
2   1126    NY     TA
3   1352    NY     NA
4   1385    CT     ME
5   1401    NJ     TA
6   1405    NJ     SC
7   1417    NJ     NA
8   1420    NJ     ME
9   1431    CT     FA
10  1433    NJ     FA
11  1442    NJ     PT
12  1564    NY     SC
13  1639    CT     TA
14  1677    CT     BC
15  1834    NY     BC
16  1882    NY     ME
17  1935    CT     NA
18  1983    NY     FA
19  1588    NY     FA
Number of rows: 20
Number of columns: 3

In [ ]:
# Libname Sample 13: Employees with salaries over $40,000

import pandas as pd

# Assuming df7 corresponds to SAMDAT7 and df5 to SAMDAT5
# Ensuring that the column names are uppercase to match the expected format
df7.columns = [x.upper() for x in df7.columns]
df5.columns = [x.upper() for x in df5.columns]

# Merging dataframes on IDNUM, ensuring both DataFrames have the 'IDNUM' column
if 'IDNUM' in df7.columns and 'IDNUM' in df5.columns:
    df13_merged = pd.merge(df7[['IDNUM', 'LNAME', 'FNAME']], df5[['IDNUM', 'SALARY']], on='IDNUM')

    # Filtering for salaries greater than $40,000
    df13_gtforty = df13_merged[df13_merged['SALARY'] > 40000]

    # Renaming columns as specified in the SAS code
    df13_gtforty = df13_gtforty.rename(columns={'LNAME': 'LASTNAME', 'FNAME': 'FIRSTNAME', 'SALARY': 'Salary'})

    # Formatting the salary as dollar values
    df13_gtforty['Salary'] = df13_gtforty['Salary'].apply(lambda x: f'${x:,.2f}')

    # Display the DataFrame
    print(df13_gtforty)

    # Show the number of columns and rows for the data output
    print(f'Number of rows: {df13_gtforty.shape[0]}')
    print(f'Number of columns: {df13_gtforty.shape[1]}')
else:
    print("Error: 'IDNUM' column is missing in one of the DataFrames")

    IDNUM      LASTNAME  FIRSTNAME       Salary
1    1017         WELCH     DARIUS   $40,858.00
7    1076        VENTER    RANDALL   $66,558.00
15   1106     MARSHBURN     JASPER   $89,632.00
16   1107      THOMPSON      WAYNE   $89,977.00
17   1111        RHODES     JEREMY   $40,586.00
24   1118        DENNIS      ROGER  $111,379.00
32   1126        KIMANI       ANNE   $40,899.00
45   1269        CASTON   FRANKLIN   $41,690.00
47   1332    STEPHENSON       ADAM   $42,178.00
48   1333      BANADYGA     JUSTIN   $88,606.00
49   1347        O'NEAL      BRYAN   $40,079.00
51   1352        RIVERS      SIMON   $53,798.00
56   1379        MORGAN     ALFRED   $42,264.00
58   1385        RAYNOR     MILTON   $43,900.00
65   1404         COHEN        LEE   $91,376.00
68   1407     GREGORSKI     DANIEL   $68,096.00
70   1409       HAVELKA    RAYMOND   $41,551.00
71   1410        HARRIS    CHARLES   $84,685.00
77   1417       NEWKIRK    WILLIAM   $52,270.00
79   1420         ROUSE     JEREMY   $43,071.00
87   1428         BRADY  CHRISTINE   $68,767.00
98   1439    HASENHAUER  CHRISTINA   $70,736.00
101  1442       NEWKIRK     SANDRA   $84,536.00
102  1443         WELLS      AGNES   $42,274.00
106  1478        NEWTON      JAMES   $84,203.00
109  1499      BAREFOOT     JOSEPH   $43,025.00
110  1521        PARKER        JAY   $41,526.00
111  1545       HERRERO      CLYDE   $66,130.00
113  1556    PENNINGTON    MICHAEL   $71,349.00
118  1639  CARTER-COHEN      KAREN   $40,260.00
125  1739    BRANCACCIO     JOSEPH   $66,517.00
126  1777        LUFKIN        ROY  $109,630.00
129  1830         TRIPP      KATHY   $84,471.00
131  1839        NORRIS      DIANE   $43,433.00
134  1882        TUCKER       ALAN   $41,538.00
135  1890    STEPHENSON     ROBERT   $91,908.00
137  1905        GRAHAM      ALVIN   $65,111.00
141  1928      UPCHURCH      LARRY   $89,858.00
142  1935     FERNANDEZ    KATRINA   $51,081.00
Number of rows: 39
Number of columns: 4

 /*==========================*/
 /* LIBNAME Sample 14        */
 /*==========================*/

title 'Libname Sample 14: Number of Passengers per Flight by Date';

proc print data=samples.SAMDAT1 noobs;
  var DATES BOARDED;
  by FLIGHT DEST;
  sumby FLIGHT;
  sum BOARDED;
run;

title 'Libname Sample 14: Maximum Number of Passengers per Flight';

proc means data=samples.SAMDAT1 fw=5 maxdec=1 max;
  var BOARDED;
  class FLIGHT;
run;

SAS Code Summary
First Part: Lists the number of passengers boarded per flight and date, grouping the data by flight and destination. It sums the number of boarded passengers by flight.
Second Part: Calculates the maximum number of passengers that boarded any flight, grouped by flight.

In [ ]:
# Libname Sample 14: Number of Passengers per Flight by Date

import pandas as pd

# Assuming DataFrame df1 corresponds to SAMDAT1
# Grouping data by FLIGHT and DEST, and then aggregating BOARDED
df14a_passengers = df1.groupby(['FLIGHT', 'DEST', 'DATES'])['BOARDED'].sum().reset_index()

# Display the DataFrame
print(df14a_passengers)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df14a_passengers.shape[0]}')
print(f'Number of columns: {df14a_passengers.shape[1]}')

   FLIGHT DEST      DATES  BOARDED
0     114  LAX 1998-03-01    172.0
1     114  LAX 1998-03-02    119.0
2     114  LAX 1998-03-03    197.0
3     114  LAX 1998-03-04    178.0
4     114  LAX 1998-03-05    117.0
5     114  LAX 1998-03-06    128.0
6     114  LAX 1998-03-07    160.0
7     132  YYZ 1998-03-01    115.0
8     132  YYZ 1998-03-02    106.0
9     132  YYZ 1998-03-03     75.0
10    132  YYZ 1998-03-04    117.0
11    132  YYZ 1998-03-05    157.0
12    132  YYZ 1998-03-06    150.0
13    132  YYZ 1998-03-07    164.0
14    202  ORD 1998-03-01    151.0
15    202  ORD 1998-03-02    120.0
16    202  ORD 1998-03-03    118.0
17    202  ORD 1998-03-04    148.0
18    202  ORD 1998-03-05    104.0
19    202  ORD 1998-03-06    115.0
20    202  ORD 1998-03-07    175.0
21    219  LON 1998-03-01    198.0
22    219  LON 1998-03-02    147.0
23    219  LON 1998-03-03    197.0
24    219  LON 1998-03-04    232.0
25    219  LON 1998-03-05    160.0
26    219  LON 1998-03-06    163.0
27    219  LON 1998-03-07    241.0
28    271  PAR 1998-03-01    138.0
29    271  PAR 1998-03-02    104.0
30    271  PAR 1998-03-03    147.0
31    271  PAR 1998-03-04    146.0
32    271  PAR 1998-03-05    177.0
33    271  PAR 1998-03-07    155.0
34    302  WAS 1998-03-01    105.0
35    302  WAS 1998-03-02     78.0
36    302  WAS 1998-03-03    123.0
37    302  WAS 1998-03-04    115.0
38    302  WAS 1998-03-06     66.0
39    302  WAS 1998-03-07    135.0
40    622  FRA 1998-03-01    207.0
41    622  FRA 1998-03-02    176.0
42    622  FRA 1998-03-03    180.0
43    622  FRA 1998-03-04    137.0
44    622  FRA 1998-03-05    185.0
45    622  FRA 1998-03-07    210.0
Number of rows: 46
Number of columns: 4

In [ ]:
# Libname Sample 14: Maximum Number of Passengers per Flight

# Grouping by FLIGHT and finding the maximum number of BOARDED
df14b_max_passengers = df1.groupby('FLIGHT')['BOARDED'].max().reset_index()

# Formatting the BOARDED column to show one decimal place
df14b_max_passengers['BOARDED'] = df14b_max_passengers['BOARDED'].apply(lambda x: f'{x:.1f}')

# Display the DataFrame
print(df14b_max_passengers)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df14b_max_passengers.shape[0]}')
print(f'Number of columns: {df14b_max_passengers.shape[1]}')

  FLIGHT BOARDED
0    114   197.0
1    132   164.0
2    202   175.0
3    219   241.0
4    271   177.0
5    302   135.0
6    622   210.0
Number of rows: 7
Number of columns: 2

 /*==========================*/
 /* LIBNAME Sample 16       */
 /*==========================*/

title 'Libname Sample 16: Contents of the SAMDAT2 Table';

proc contents data=samples.SAMDAT2;
run;

SAS Code Summary
The SAS proc contents command provides detailed metadata about a dataset (SAMDAT2), such as column names, types, lengths, and other attributes.

In [ ]:
# Libname Sample 16: Contents of the SAMDAT2 Table

import pandas as pd

# Assuming DataFrame df2 corresponds to SAMDAT2
# Displaying detailed information about df2
print("DataFrame Info:")
df16_samdat2_info = df2.info()

# Show the number of columns and rows for the data output
print(f'Number of rows: {df2.shape[0]}')
print(f'Number of columns: {df2.shape[1]}')

# Detailed data types of each column
print("Column Data Types:")
print(df2.dtypes)

# To check for duplicate columns and merge them (if necessary)
df2 = df2.loc[:,~df2.columns.duplicated()]

# Showing additional memory usage information
print("Detailed Memory Usage:")
print(df2.info(memory_usage='deep'))

DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 2.6+ KB
Number of rows: 46
Number of columns: 7
Column Data Types:
FLIGHT              object
DATES       datetime64[ns]
ORIG                object
DEST                object
DELAYCAT            object
DESTYPE             object
DELAY              float64
dtype: object
Detailed Memory Usage:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   FLIGHT    46 non-null     object
 1   DATES     46 non-null     datetime64[ns]
 2   ORIG      46 non-null     object
 3   DEST      46 non-null     object
 4   DELAYCAT  46 non-null     object
 5   DESTYPE   46 non-null     object
 6   DELAY     46 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 15.0 KB
None

/*==========================*/
 /* LIBNAME Sample 17        */
 /*==========================*/

title 'Libname Sample 17: Ranking of Delayed Flights';

options pageno=1;

proc rank data=samples.SAMDAT2 descending
    ties=low out=work.ranked;
  var DELAY;
  ranks RANKING;
run;

proc print data=work.ranked;
  format DELAY 2.0;
run;

SAS Code Summary
This SAS program performs the following steps:

Ranking: It ranks the flights based on the DELAY column in descending order from the dataset SAMDAT2. The ties=low option indicates that in the event of ties, the lowest rank (i.e., the highest priority) is assigned.
Output: It creates a new dataset ranked with the ranking included.
Printing: It prints the ranked dataset with the DELAY formatted to 2 decimal places.

In [ ]:
# Libname Sample 17: Ranking of Delayed Flights

import pandas as pd

# Assuming DataFrame df2 corresponds to SAMDAT2
# Ranking the 'DELAY' in descending order, handling ties by assigning the lowest rank to the highest values
df17_ranked = df2.copy()
df17_ranked['RANKING'] = df17_ranked['DELAY'].rank(method='min', ascending=False)

# Formatting the DELAY to show only two decimal places
df17_ranked['DELAY'] = df17_ranked['DELAY'].round(2)

# Display the DataFrame
print(df17_ranked)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df17_ranked.shape[0]}')
print(f'Number of columns: {df17_ranked.shape[1]}')

   FLIGHT      DATES ORIG DEST      DELAYCAT        DESTYPE  DELAY  RANKING
0     114 1998-03-01  LGA  LAX  1-10 Minutes       Domestic    8.0      9.0
1     202 1998-03-01  LGA  ORD      No Delay       Domestic   -5.0     42.0
2     219 1998-03-01  LGA  LON   11+ Minutes  International   18.0      4.0
3     622 1998-03-01  LGA  FRA      No Delay  International   -5.0     42.0
4     132 1998-03-01  LGA  YYZ   11+ Minutes  International   14.0      8.0
5     271 1998-03-01  LGA  PAR  1-10 Minutes  International    5.0     13.0
6     302 1998-03-01  LGA  WAS      No Delay       Domestic   -2.0     36.0
7     114 1998-03-02  LGA  LAX      No Delay       Domestic    0.0     28.0
8     202 1998-03-02  LGA  ORD  1-10 Minutes       Domestic    5.0     13.0
9     219 1998-03-02  LGA  LON   11+ Minutes  International   18.0      4.0
10    622 1998-03-02  LGA  FRA      No Delay  International    0.0     28.0
11    132 1998-03-02  LGA  YYZ  1-10 Minutes  International    5.0     13.0
12    271 1998-03-02  LGA  PAR  1-10 Minutes  International    4.0     19.0
13    302 1998-03-02  LGA  WAS      No Delay       Domestic    0.0     28.0
14    114 1998-03-03  LGA  LAX      No Delay       Domestic   -1.0     32.0
15    202 1998-03-03  LGA  ORD      No Delay       Domestic   -1.0     32.0
16    219 1998-03-03  LGA  LON  1-10 Minutes  International    4.0     19.0
17    622 1998-03-03  LGA  FRA      No Delay  International   -2.0     36.0
18    132 1998-03-03  LGA  YYZ  1-10 Minutes  International    6.0     12.0
19    271 1998-03-03  LGA  PAR  1-10 Minutes  International    2.0     25.0
20    302 1998-03-03  LGA  WAS  1-10 Minutes       Domestic    5.0     13.0
21    114 1998-03-04  LGA  LAX   11+ Minutes       Domestic   15.0      6.0
22    202 1998-03-04  LGA  ORD      No Delay       Domestic   -5.0     42.0
23    219 1998-03-04  LGA  LON  1-10 Minutes  International    3.0     22.0
24    622 1998-03-04  LGA  FRA   11+ Minutes  International   30.0      1.0
25    132 1998-03-04  LGA  YYZ      No Delay  International   -5.0     42.0
26    271 1998-03-04  LGA  PAR  1-10 Minutes  International    5.0     13.0
27    302 1998-03-04  LGA  WAS  1-10 Minutes       Domestic    7.0     10.0
28    114 1998-03-05  LGA  LAX      No Delay       Domestic   -2.0     36.0
29    202 1998-03-05  LGA  ORD  1-10 Minutes       Domestic    2.0     25.0
30    219 1998-03-05  LGA  LON  1-10 Minutes  International    3.0     22.0
31    622 1998-03-05  LGA  FRA      No Delay  International   -6.0     46.0
32    132 1998-03-05  LGA  YYZ  1-10 Minutes  International    3.0     22.0
33    271 1998-03-05  LGA  PAR  1-10 Minutes  International    5.0     13.0
34    114 1998-03-06  LGA  LAX      No Delay       Domestic   -1.0     32.0
35    202 1998-03-06  LGA  ORD      No Delay       Domestic   -3.0     41.0
36    219 1998-03-06  LGA  LON   11+ Minutes  International   27.0      2.0
37    132 1998-03-06  LGA  YYZ  1-10 Minutes  International    7.0     10.0
38    302 1998-03-06  LGA  WAS  1-10 Minutes       Domestic    1.0     27.0
39    114 1998-03-07  LGA  LAX      No Delay       Domestic   -1.0     32.0
40    202 1998-03-07  LGA  ORD      No Delay       Domestic   -2.0     36.0
41    219 1998-03-07  LGA  LON   11+ Minutes  International   15.0      6.0
42    622 1998-03-07  LGA  FRA   11+ Minutes  International   21.0      3.0
43    132 1998-03-07  LGA  YYZ      No Delay  International   -2.0     36.0
44    271 1998-03-07  LGA  PAR  1-10 Minutes  International    4.0     19.0
45    302 1998-03-07  LGA  WAS      No Delay       Domestic    0.0     28.0
Number of rows: 46
Number of columns: 8

/*==========================*/
 /* LIBNAME Sample 18        */
 /*==========================*/

title 'Libname Sample 18: Number of Employees by Jobcode';

proc tabulate data=samples.SAMDAT5 format=3.0;
   class JOBCODE;
   table JOBCODE*n;
   keylabel n="#";
run;

SAS Code Summary
This SAS program generates a table that counts the number of entries (employees) for each unique JOBCODE. This is a common task when summarizing categorical data, and proc tabulate is particularly suited for creating complex summary tables.

In [ ]:
# Libname Sample 18: Number of Employees by Jobcode

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5
# Counting the number of employees per JOBCODE
df18_jobcode_counts = df5['JOBCODE'].value_counts().reset_index()
df18_jobcode_counts.columns = ['JOBCODE', '# of Employees']

# Display the result
print(df18_jobcode_counts)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df18_jobcode_counts.shape[0]}')
print(f'Number of columns: {df18_jobcode_counts.shape[1]}')

   JOBCODE  # of Employees
0      TA2              20
1      FA2              16
2      ME2              14
3      TA3              12
4      FA1              11
5      PT2              10
6      TA1               9
7      BCK               9
8      PT1               8
9      ME1               8
10     SCP               7
11     FA3               7
12     ME3               7
13     NA1               5
14     NA2               3
15     PT3               2
Number of rows: 16
Number of columns: 2

 /*==========================*/
 /* LIBNAME Sample 19        */
 /*==========================*/

title 'Libname Sample 19: SAMAT5 After Appending SAMDAT6';

proc append base=samples.SAMDAT5
            data=samples.SAMDAT6;
run;

proc print data=samples.SAMDAT5;
run;

SAS Code Summary
The proc append procedure in SAS is an efficient way to append rows from one dataset (data) to another (base), typically more efficient than concatenating datasets because it appends in place without creating a new dataset unless necessary. After the append operation, the combined data is displayed with proc print.

In [ ]:
# Libname Sample 19: SAMAT5 After Appending SAMDAT6

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5 and DataFrame df6 to SAMDAT6
# Appending df6 to df5
df19_samdat5_appended = df5.append(df6, ignore_index=True)

# Display the updated DataFrame df5 after appending df6
print(df19_samdat5_appended)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df19_samdat5_appended.shape[0]}')
print(f'Number of columns: {df19_samdat5_appended.shape[1]}')

AttributeError: 'DataFrame' object has no attribute 'append'

In [ ]:
# Libname Sample 19: SAMAT5 After Appending SAMDAT6

import pandas as pd

# Assuming DataFrame df5 corresponds to SAMDAT5 and DataFrame df6 to SAMDAT6
# Appending df6 to df5 using pd.concat() instead of append()
df19_samdat5_appended = pd.concat([df5, df6], ignore_index=True)

# Display the updated DataFrame df5 after appending df6
print(df19_samdat5_appended)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df19_samdat5_appended.shape[0]}')
print(f'Number of columns: {df19_samdat5_appended.shape[1]}')

    SEX JOBCODE   SALARY      BIRTH      HIRED
0     M     TA1  28880.0 1959-03-02 1992-03-26
1     M     TA3  40858.0 1957-12-28 1981-10-16
2     F     TA3  39392.0 1965-05-19 1984-10-23
3     F     TA1  28558.0 1964-04-10 1992-09-13
4     F     TA1  26533.0 1969-11-09 1991-11-23
..   ..     ...      ...        ...        ...
155   M     TA3  36598.0 1961-12-28 1987-03-13
156   F     FA1  22123.0 1972-08-07 1992-10-29
157   M     TA3  36514.0 1963-11-30 1987-10-07
158   F     TA3  42260.0 1957-06-26 1984-01-28
159   M     SCP  23100.0 1970-09-10 1992-11-02

[160 rows x 5 columns]
Number of rows: 160
Number of columns: 5

 /*==========================*/
 /* LIBNAME Sample 20        */
 /*==========================*/

title 'Libname Sample 20: Invoice Frequency by Country';

proc freq data=samples.SAMDAT9 (keep=INVNUM COUNTRY);
  tables COUNTRY;
run;

SAS Code Summary
The SAS program: Uses proc freq to analyze and produce a frequency distribution for the COUNTRY column after keeping only the INVNUM and COUNTRY columns from the dataset SAMDAT9.

In [ ]:
# Libname Sample 20: Invoice Frequency by Country

import pandas as pd

# Assuming DataFrame df9 corresponds to SAMDAT9 and contains columns INVNUM and COUNTRY
# Keeping only the relevant columns
df20_filtered = df9[['INVNUM', 'COUNTRY']]

# Calculating frequency of each country
country_frequency = df20_filtered['COUNTRY'].value_counts().reset_index()
country_frequency.columns = ['COUNTRY', 'FREQUENCY']

# Display the frequency distribution
print(country_frequency)

# Show the number of columns and rows for the data output
print(f'Number of rows: {country_frequency.shape[0]}')
print(f'Number of columns: {country_frequency.shape[1]}')

     COUNTRY  FREQUENCY
0        USA         10
1     Brazil          4
2  Argentina          2
3  Australia          1
Number of rows: 4
Number of columns: 2

 /*==========================*/
 /* LIBNAME Sample 21        */
 /*==========================*/

title 'Libname Sample 21: High Bills--Not Paid';

proc sql;
  create view work.allinv as
  select PAIDON, BILLEDON, INVNUM, AMTINUS, BILLEDTO
    from samples.SAMDAT9 (obs=5);
quit;

data work.notpaid(keep=INVNUM BILLEDTO AMTINUS BILLEDON);

  set work.allinv;
  where PAIDON is missing and AMTINUS>=300000.00;
run;

proc print data=work.notpaid label;
  format AMTINUS dollar20.2;
  label  AMTINUS=amountinus
         BILLEDON=billedon
         INVNUM=invoicenum
         BILLEDTO=billedto;
run;

SAS Code Summary
Creating a View: A view named allinv is created with the first 5 observations from SAMDAT9 that includes selected columns: PAIDON, BILLEDON, INVNUM, AMTINUS, and BILLEDTO.
Filtering Data: A new dataset notpaid is created from allinv, keeping only invoices where PAIDON is missing and AMTINUS is at least 300,000.00.
Printing the Data: The dataset notpaid is printed with formatted monetary values and custom labels for columns.

In [68]:
# Libname Sample 21: High Bills--Not Paid

import pandas as pd

# Assuming DataFrame df9 corresponds to SAMDAT9
# Creating a view (equivalent in pandas)
df21_allinv = df9[['PAIDON', 'BILLEDON', 'INVNUM', 'AMTINUS', 'BILLEDTO']].head(5)

# Filtering to find not paid high bills
df21_notpaid = df21_allinv[df21_allinv['PAIDON'].isna() & (df21_allinv['AMTINUS'] >= 300000)]

# Applying formatting and labeling
df21_notpaid['AMTINUS'] = df21_notpaid['AMTINUS'].apply(lambda x: f'${x:,.2f}')
df21_notpaid.rename(columns={'AMTINUS': 'amountinus', 'BILLEDON': 'billedon', 'INVNUM': 'invoicenum', 'BILLEDTO': 'billedto'}, inplace=True)

# Display the DataFrame
print(df21_notpaid)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df21_notpaid.shape[0]}')
print(f'Number of columns: {df21_notpaid.shape[1]}')

  PAIDON   billedon  invoicenum      amountinus  billedto
1    NaT 1998-10-05     11271.0  $11,063,836.00  18543489
Number of rows: 1
Number of columns: 5

C:\Users\comma\AppData\Local\Temp\ipykernel_30200\4237621202.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df21_notpaid['AMTINUS'] = df21_notpaid['AMTINUS'].apply(lambda x: f'${x:,.2f}')
C:\Users\comma\AppData\Local\Temp\ipykernel_30200\4237621202.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df21_notpaid.rename(columns={'AMTINUS': 'amountinus', 'BILLEDON': 'billedon', 'INVNUM': 'invoicenum', 'BILLEDTO': 'billedto'}, inplace=True)

In [70]:
df9

,INVNUM,BILLEDTO,AMTBILL,COUNTRY,AMTINUS,BILLEDBY,BILLEDON,PAIDON
0,11270.0,39045213,8.738601e+09,Brazil,2256870.0,239185.0,1998-10-05,1998-10-18
1,11271.0,18543489,1.106384e+07,USA,11063836.0,457232.0,1998-10-05,NaT
2,11273.0,19783482,2.521485e+05,USA,252148.5,239185.0,1998-10-06,1998-11-11
3,11276.0,14324742,1.934460e+06,USA,1934460.0,135673.0,1998-10-06,1998-10-20
4,11278.0,14898029,1.400825e+06,USA,1400825.0,239185.0,1998-10-06,1998-10-19
5,11280.0,39045213,8.738601e+09,Brazil,2256870.0,423286.0,1998-10-07,1998-10-20
6,11282.0,19783482,2.521485e+05,USA,252148.5,457232.0,1998-10-07,1998-10-25
7,11285.0,38763919,2.234301e+06,Argentina,2256870.0,239185.0,1998-10-10,1998-11-30
8,11286.0,43459747,1.483660e+07,Australia,11063836.0,423286.0,1998-10-10,NaT
9,11287.0,15432147,2.521485e+05,USA,252148.5,457232.0,1998-10-11,1998-11-04
10,12051.0,39045213,8.738601e+09,Brazil,2256870.0,457232.0,1998-11-02,NaT
11,12102.0,18543489,1.106384e+07,USA,11063836.0,239185.0,1998-11-17,NaT
12,12263.0,19783482,2.521485e+05,USA,252148.5,423286.0,1998-12-05,NaT
13,12468.0,14898029,1.400825e+06,USA,1400825.0,135673.0,1998-12-24,1999-01-02
14,12471.0,39045213,8.738601e+09,Brazil,2256870.0,457232.0,1998-12-27,NaT
15,12476.0,38763919,2.234301e+06,Argentina,2256870.0,135673.0,1998-12-24,NaT
16,12478.0,15432147,2.521485e+05,USA,252148.5,423286.0,1998-12-24,1999-01-02

/*==========================*/
 /* LIBNAME Sample 22        */
 /*==========================*/

title 'Libname Sample 22: Interns Who Are Family Members of Employees';


proc sql;
  create view emp_csr as
  select * from samples.SAMDAT10
    where dept in ('CSR010', 'CSR011', 'CSR004');

  select samdat13.LASTNAME, samdat13.FIRSTNAM, samdat13.EMPID,
         samdat13.FAMILYID, samdat13.GENDER,
         samdat13.DEPT, samdat13.HIREDATE
    from emp_csr, samples.samdat13
    where emp_csr.EMPID=samdat13.FAMILYID;
quit;

SAS Code Summary
View Creation: A view named emp_csr is created from SAMDAT10 to include only employees from certain departments.
Data Selection: Data is selected from another dataset (SAMDAT13) based on a join condition that matches the family IDs of the interns to the employee IDs in the view.

In [ ]:
df13

,EMPID,HIREDATE,DEPT,GENDER,LASTNAME,FIRSTNAM,MIDDLENA,FAMILYID
0,765111.0,1998-05-04,CSR011,M,NISHIMATSU-LYNCH,RICHARD,ITO,677890.0
1,765112.0,1998-05-04,CSR010,M,SMITH,ROBERT,MICHAEL,234967.0
2,219776.0,1998-04-15,ACC024,F,PASTORELLI,ZORA,None,NaN
3,245233.0,1998-04-10,ACC013,None,ALI,SADIQ,H.,NaN
4,245234.0,1998-04-10,ACC024,F,MEHAILESCU,NADIA,P.,NaN
5,326721.0,1998-05-01,SHP002,M,CALHOUN,WILLIS,BEAUREGARD,NaN

In [72]:
# Libname Sample 22: Interns Who Are Family Members of Employees

import pandas as pd

# Assuming DataFrame df10 corresponds to SAMDAT10 and DataFrame df13 to SAMDAT13
# Creating the view equivalent by filtering df10 for specific departments
df22_emp_csr = df10[df10['DEPT'].isin(['CSR010', 'CSR011', 'CSR004'])]

# Joining df22_emp_csr with df13 on EMPID matching FAMILYID
df22_family_interns = pd.merge(df22_emp_csr, df13, left_on='EMPID', right_on='FAMILYID')

# Selecting the desired columns
df22_family_interns = df22_family_interns[['LASTNAME', 'FIRSTNAM', 'EMPID', 'FAMILYID', 'GENDER', 'DEPT', 'HIREDATE']]

# Display the DataFrame
print(df22_family_interns)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df22_family_interns.shape[0]}')
print(f'Number of columns: {df22_family_interns.shape[1]}')

KeyError: "['LASTNAME', 'EMPID', 'GENDER', 'DEPT', 'HIREDATE'] not in index"

In [74]:
df22_family_interns

,EMPID_x,HIREDATE_x,SALARY,DEPT_x,JOBCODE,GENDER_x,BIRTHDTE,LASTNAME_x,FRSTNAME,MIDNAME,PHONE,EMPID_y,HIREDATE_y,DEPT_y,GENDER_y,LASTNAME_y,FIRSTNAM,MIDDLENA,FAMILYID
0,234967.0,1993-12-19,17000.0,CSR004,602.0,M,1972-12-21,SMITH,GILBERT,IRVINE,7274,765112.0,1998-05-04,CSR010,M,SMITH,ROBERT,MICHAEL,234967.0
1,677890.0,1993-12-12,37610.0,CSR010,204.0,F,1970-04-24,NISHIMATSU-LYNCH,CAROL,ANNE,6245,765111.0,1998-05-04,CSR011,M,NISHIMATSU-LYNCH,RICHARD,ITO,677890.0

In [ ]:
# Libname Sample 22: Interns Who Are Family Members of Employees

import pandas as pd

# Assuming DataFrame df10 corresponds to SAMDAT10 and DataFrame df13 to SAMDAT13
# Creating the view equivalent by filtering df10 for specific departments
df22_emp_csr = df10[df10['DEPT'].isin(['CSR010', 'CSR011', 'CSR004'])]

# Ensuring that column names in both DataFrames are uppercase
df22_emp_csr.columns = [col.upper() for col in df22_emp_csr.columns]
df13.columns = [col.upper() for col in df13.columns]

# Joining df22_emp_csr with df13 on EMPID matching FAMILYID
df22_family_interns = pd.merge(df22_emp_csr, df13, left_on='EMPID', right_on='FAMILYID')

# Selecting the desired columns, ensuring they exist in the merged DataFrame
columns_to_select = ['LASTNAME', 'FIRSTNAM', 'EMPID', 'FAMILYID', 'GENDER', 'DEPT', 'HIREDATE']
df22_family_interns = df22_family_interns[[col for col in columns_to_select if col in df22_family_interns.columns]]

# Display the DataFrame
print(df22_family_interns)

# Show the number of columns and rows for the data output
print(f'Number of rows: {df22_family_interns.shape[0]}')
print(f'Number of columns: {df22_family_interns.shape[1]}')

  FIRSTNAM  FAMILYID
0   ROBERT  234967.0
1  RICHARD  677890.0
Number of rows: 2
Number of columns: 2